# FormUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormUtils Class
Members See Also
---
Define Form utility functions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FormUtils
```

Visual Basic
---
```text
Public NotInheritable Class FormUtils
```

Visual C++
---
```text
public ref class FormUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FormUtils
# See Also
FormUtils Members
Autodesk.Revit.DB Namespace